---
kind: method
id: M:Autodesk.Revit.DB.ExternalDefinitionCreationOptions.GetDataType
source: html/1c61fba2-6eaf-a1ba-44f9-38ca6b29105f.htm
---
# Autodesk.Revit.DB.ExternalDefinitionCreationOptions.GetDataType Method

Gets the identifier describing the parameter's data type.
 The identifier may belong to either a spec or a category.
 If it is a category, the parameter is a Family Type parameter of that
 category.

## Syntax (C#)
```csharp
public ForgeTypeId GetDataType()
```